tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "puppetlabs/puppet"
tap "vitorgalvao/tiny-scripts"
brew "autoconf"
brew "bash-completion"
brew "libpng"
brew "fontconfig"
brew "gettext"
brew "gdbm"
brew "libffi"
brew "openssl"
brew "pcre"
brew "readline"
brew "sqlite"
brew "glib"
brew "pixman"
brew "cairo"
brew "carthage"
brew "cmake"
brew "ctags"
brew "go"
brew "dos2unix"
brew "duff"
brew "exa"
brew "exiftool"
brew "fdupes"
brew "fribidi"
brew "gmp"
brew "libevent"
brew "libtasn1"
brew "libunistring"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "graphite2"
brew "icu4c"
brew "jpeg"
brew "lame"
brew "libtiff"
brew "little-cms2"
brew "libass"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "ghostscript"
brew "git"
brew "glances"
brew "pkg-config"
brew "gobject-introspection"
brew "gpac"
brew "graphviz"
brew "hexyl"
brew "htop"
brew "httpstat"
brew "hugo"
brew "imagemagick"
brew "irssi"
brew "isl"
brew "jhead"
brew "jq"
brew "libgpg-error"
brew "libgcrypt"
brew "mpfr"
brew "libmpc"
brew "links"
brew "lua"
brew "mas"
brew "md5sha1sum"
brew "mosh"
brew "mpv"
brew "mtr"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "nvm"
brew "openssl@1.1"
brew "p7zip"
brew "pigz"
brew "pngcrush"
brew "pv"
brew "pwgen"
brew "ruby-build"
brew "rbenv"
brew "rename"
brew "sloccount"
brew "slurm"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "stow"
brew "telnet"
brew "tiff2png"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "upx"
brew "vim"
brew "weechat"
brew "wget"
brew "wireguard-tools"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "adobe-creative-cloud"
cask "aerial"
cask "alfred"
cask "amethyst"
cask "autopano-giga"
cask "bill"
cask "cheatsheet"
cask "dash"
cask "discord"
cask "divvy"
cask "docker"
cask "drivethrurpg"
cask "drivethrurpg-library"
cask "dropbox"
cask "exodus"
cask "fantasy-grounds"
cask "filezilla"
cask "firefox"
cask "flux"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "franz"
cask "freecad"
cask "google-chrome"
cask "gpg-suite-beta"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "keepassx"
cask "keybase"
cask "mactex"
cask "microsoft-office"
cask "mpv"
cask "mysqlworkbench"
cask "nagstamon"
cask "nerdtool"
cask "obs"
cask "paragon-ntfs"
cask "posterazor"
cask "presentation"
cask "signal"
cask "skype"
cask "spotify"
cask "steam"
cask "syrinscape"
cask "teamspeak-client"
cask "texpad"
cask "thunderbird"
cask "timemachineeditor"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "Carcassonne", id: 901869346
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Mactracker", id: 430255202
mas "Microsoft Remote Desktop", id: 1295203466
mas "MoneyMoney", id: 872698314
mas "Nightlight", id: 1429386865
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Telephone", id: 406825478
mas "Texpad", id: 458866234
mas "Things", id: 904280696
mas "Tweetbot", id: 557168941
mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
mas "XMind", id: 1327661892
