tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jeantil/autokbisw"
tap "puppetlabs/puppet"
tap "vitorgalvao/tiny-scripts"
brew "bash"
brew "bash-completion"
brew "pcre"
brew "carthage"
brew "ctags"
brew "dos2unix"
brew "duff"
brew "erlang"
brew "exa"
brew "exiftool"
brew "fdupes"
brew "ffmpeg"
brew "node"
brew "fx"
brew "fzf"
brew "gcc"
brew "git"
brew "glances"
brew "go"
brew "gobject-introspection"
brew "gpac"
brew "graphviz"
brew "hexyl"
brew "htop"
brew "httpstat"
brew "hugo"
brew "iftop"
brew "imagemagick"
brew "irssi"
brew "jhead"
brew "jq"
brew "links"
brew "lynx"
brew "mas"
brew "mkcert"
brew "mosh"
brew "mpv", link: false
brew "mtr"
brew "mutt"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "nss"
brew "nvm"
brew "p7zip"
brew "pandoc"
brew "peco"
brew "pigz"
brew "pngcrush"
brew "prettier"
brew "pv"
brew "pwgen"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "rename"
brew "restic"
brew "shellcheck"
brew "sloccount"
brew "slurm"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "stow"
brew "telnet"
brew "the_silver_searcher"
brew "tiff2png"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "upx"
brew "v8"
brew "v8@3.15"
brew "vim"
brew "weechat"
brew "wget"
brew "wireguard-go"
brew "wireguard-tools"
brew "jeantil/autokbisw/autokbisw"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "adobe-creative-cloud"
cask "aerial"
cask "alfred"
cask "autopano-giga"
cask "bettertouchtool"
cask "blender"
cask "cheatsheet"
cask "coconutbattery"
cask "dash"
cask "discord"
cask "divvy"
cask "docker"
cask "drivethrurpg"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-g-for-powerline"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "franz"
cask "google-chrome"
cask "gpg-suite"
cask "handbrake"
cask "imageoptim"
cask "jqbx"
cask "keepassx"
cask "keybase"
cask "keyboard-cleaner"
cask "mactex"
cask "microsoft-office"
cask "mpv"
cask "mysqlworkbench"
cask "nagstamon"
cask "ngrok"
cask "obs"
cask "paragon-ntfs"
cask "posterazor"
cask "presentation"
cask "signal"
cask "sketchup"
cask "skype"
cask "spotify"
cask "steam"
cask "syncthing"
cask "teamspeak-client"
cask "texpad"
cask "thunderbird"
cask "timemachineeditor"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "Carcassonne", id: 901869346
mas "Deliveries", id: 924726344
mas "EasyRes", id: 688211836
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "LyricsX", id: 1254743014
mas "Mactracker", id: 430255202
mas "Microsoft Remote Desktop", id: 1295203466
mas "MoneyMoney", id: 872698314
mas "Nightlight", id: 1429386865
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPer", id: 1421915518
mas "PiPifier", id: 1160374471
mas "Pomo Timer", id: 1447569061
mas "Slack", id: 803453959
mas "Sweet Home 3D", id: 669289700
mas "Telephone", id: 406825478
mas "Texpad", id: 458866234
mas "Things", id: 904280696
mas "Tweetbot", id: 557168941
mas "uBlock", id: 1385985095
mas "Xcode", id: 497799835
mas "XMind", id: 1327661892
