1password
adobe-creative-cloud
alfred
amethyst
anaconda
autopano-giga
bettertouchtool
bill
dash
discord
divvy
docker
dropbox
exodus
filezilla
firefox
flux
font-anonymice-powerline
font-consolas-for-powerline
font-dejavu-sans-mono-for-powerline
font-droid-sans-mono-for-powerline
font-fira-mono-for-powerline
font-inconsolata-dz-for-powerline
font-inconsolata-for-powerline
font-inconsolata-g-for-powerline
font-liberation-mono-for-powerline
font-menlo-for-powerline
font-meslo-for-powerline
font-monofur-for-powerline
font-roboto-mono-for-powerline
font-source-code-pro-for-powerline
font-ubuntu-mono-derivative-powerline
franz
freefilesync
google-chrome
gpg-suite-beta
handbrake
hipchat
imageoptim
iterm2
keepassx
keeweb
keybase
ledger-live
mactex
mpv
mysqlworkbench
nagstamon
nerdtool
obs
paragon-ntfs
presentation
skype
spotify
steam
syrinscape
teamspeak-client
texpad
thunderbird
timemachinescheduler
tunnelblick
vagrant
virtualbox
virtualbox-extension-pack
visual-studio-code
vlc
vmware-fusion
wireshark
